<template>
    <div class="agreement">
        <Back>代扣服务协议</Back>
        <div class="cantainer agreement-bd">
            <p class="h3">第一条 总则</p>
            <p>本服务协议（以下简称“本协议”）是汉信互联网金融服务（武汉）股份有限公司（以下简称“平台”）与平台用户（以下简称“用户”或“您”)就代扣服务的使用等相关事项所订立的有效合约。用户通过网络页面点击确认或以其他方式选择接受本协议，即表示用户与平台已达成协议并同意接受本协议的全部约定内容。在接受本协议之前，请您仔细阅读本协议的全部内容，尤其是加粗加下划线部分的内容。如果您不同意本协议的任意内容，或者无法准确理解平台对条款的解释，请不要进行后续操作。</p>
            <p class="b">代扣服务的定义：是指平台根据您的授权，向平台合作的第三方支付机构（包括但不限于宝付网络科技（上海）有限公司，下称“第三方支付机构”）发送扣款指令，由第三方支付机构提供资金代扣及转账服务。</p>
    
            <p class="h3">第二条 用户的权利义务</p>
            <p>
                <span class="b">（一）您确认在使用本服务的意思表示出自您的真实意愿；</span>同时您对使用本服务过程中发出的指令的真实性及有效性承担全部责任，该指令视为您的真实意思表示且不可变更或撤销。您承诺，平台依照您的指令进行操作的一切风险均由您承担。</p>
            <p>（二）
                <span class="b">您同意承诺不会利用本服务从事任何非法的或违反本协议目的或者侵犯其他第三方权益的行为，</span>否则平台有权立即单方面终止提供本服务，并不承担任何责任；如果因您的行为给平台造成损失的，您应承担全部赔偿责任。</p>
            <p>（三）您授权平台在您使用本服务期间或平台终止提供本服务后，有权保留您在使用本服务期间所形成的相关信息数据，同时该授权不可撤销。</p>
            <p>（四）您保证在使用本服务的过程中提供的资料真实、完整、有效。对于因您提供不真实或者不完整信息造成的损失由您自行承担。您必须正确填写相关页面信息，并妥善保管预留信息，除为本协议目的使用外，不得向任何他人泄露信息内容，否则因此导致的责任均由您承担。</p>
            <p class="b">（五）您理解并同意，平台向第三方支付机构提交的支付数据已获得您本人的有效授权，即您同意授权平台向第三方支付机构发送扣款指令，由第三方支付机构从您的银行账户、平台账户余额或其他扣款渠道中扣取指定款项至第三方账户。</p>
            <p>（六）您理解并同意，您选择使用本服务，第三方支付机构有权向您收取一定的手续费，手续费具体收费标准以第三方支付机构公布的为准。</p>
            <p>（七）您理解并同意，与您的平台账户绑定的银行卡账户能否成为代扣款项来源，取决于银行卡的发卡银行设定的业务规则，平台无法保证所有平台账户绑定的银行卡均能实现代扣功能，具体以页面提示或者反馈给您的代扣结果为准。</p>
            <p>（八）您理解并同意，您的平台账户异常、银行扣款异常、支付不成功、充值不成功、转账不成功等情况发生时，将导致扣款失败，因此扣款失败导致的一切法律责任由您本人承担。</p>
            <p>（九）您理解并同意，使用本服务时您的平台账户必须已经绑定手机，若没有绑定手机，则须在签订本协议之后按照页面提示绑定手机，否则无法使用本服务。</p>
            <p>（十）您在使用本服务期间，除非您发送的代扣指令明确特定扣款渠道，否则第三方支付机构可以自由选择扣款渠道。扣款渠道包括但不限于平台账户余额、已经开通快捷支付的银行卡等，且第三方支付机构有权根据实际情况决定扣款渠道的顺序。</p>
            <p>（十一）您理解并同意，若因相关服务机构错误导致您未能及时偿付相关款项而产生违约金或者多扣、重复扣款的，因此导致的所有责任及损失，均由您与银行或相关支付机构自行协商解决。平台仅在合理的范围内，负责相关协调及沟通工作。</p>
            <p>（十二）您在使用本服务的过程中，应确保您有足额的款项可用于第三方支付机构执行相应扣款指令，因账户资金不足扣款失败导致的损失，须由您自行承担。</p>
            <p>（十三）您理解并同意，平台根据您的授权向第三方支付机构发送扣款指令，平台对指令的真实性和准确性不负有审查义务。除非平台没有依照您的指令进行操作，或操作指令错误，否则平台不对本服务产生的损失和责任负责。</p>
            <p>（十四）您理解并同意，基于风险的防范与控制，平台会不时设定涉及交易的相关事项，包括但不限于交易限额、交易次数等。您了解，该等设定可能会对您的交易造成一定不便，您对此没有异议。</p>
            <p>（十五）您在使用平台提供的本项服务时，必须同时遵守平台网站不时公布相关附属规则，否则因此导致责任，均由您自行承担。</p>
    
            <p class="h3">第三条 平台的权利、义务</p>
            <p>（一）平台对您的注册信息负有保密义务，但在必要时平台有权将相关信息提供给平台的监管机关及合作银行等。</p>
            <p>（二）平台有义务在技术上确保代扣服务的安全、有效、正常运行，保证您的正常使用。</p>
            <p>（三）平台可以在法律法规许可或您授权的范围内使用您在平台留存的资料或交易信息等。</p>
            <p>（四）除本协议另有规定外，平台在提前邮件通知您或在网站公告的情况下，可以单方面终止向您提供本服务，并不承担任何赔偿责任。平台在终止提供本服务后，若发现您之前存在违法或违反本协议目的的使用行为，给平台造成损失的，则平台仍可据此要求您承担相应赔偿责任并保留通过司法途径予以解决的权利。</p>
            <p>（五）平台负责向您提供代扣业务咨询服务，并在平台网站公布功能介绍、使用规则等内容。</p>
    
            <p class="h3">第四条 协议修改</p>
            <p>（一）平台将有权随时修改本协议的有关条款，一旦相关内容发生变动，平台公司将会通过电子邮件或网站公告等方式向您提示修改内容。</p>
            <p>（二）如果您不同意平台对本协议相关条款所做的修改或者平台不时公布的相关附属规则，您应立即停止使用平台提供的本项服务。如果您继续使用平台提供的服务，则视为您接受并认可本协议相关条款的修改及平台不时公布的相关附属规则。</p>
    
            <p class="h3">第五条争议的解决</p>
            <p>双方在履行本协议的过程中，如发生争议，应协商解决。协商不成的，任何一方均可向汉信互联网金融服务（武汉）股份有限公司所在地有管辖权的人民法院提起诉讼。</p>
    
            <p class="h3">第六条协议的解释</p>
            <p>本协议的成立、生效、履行和解释，均适用中华人民共和国法律；法律无明文规定的，应适用平台制定的业务规则和通行的商业惯例。本协议最终解释权归汉信互联网金融服务（武汉）股份有限公司。</p>
    
        </div>
    
    </div>
</template>

<script>
import Back from '../toolcomponents/back';
export default {
    name: 'agreement',
    components: {
        Back
    }
}
</script>


<style lang="less" scoped>
@import 'main.less';
</style>

