<template>
    <div class="agreement">
        <Back>借款协议</Back>
        <div class="cantainer agreement-bd">
            <p>协议编号：{{agreementNo}}</p>
            <p>出借人：见本协议附件《出借人列表》 </p>
            <p>借款人：{{trueName}}</p>
            <p>身份证号：{{idNo}}</p>
            <p>手机号码：{{mobile}}</p>
            <p>出借人和借款人同意通过汉信互联网金融服务（武汉）股份有限公司（下称“居间服务人”）的服务、以电子合同的形式达成本借款协议，本借款协议的内容经双方充分阅读且知晓每一条款的含义，是双方真实意思表示。</p>
            <p class="h3">一、借款 </p>
            <p>1.1 借款基本信息</p>
            <table class="table">
                <tr>
                    <td>借款用途</td>
                    <td colspan="2">资金周转</td>
                </tr>
                <tr>
                    <td>借款本金数额</td>
                    <td>小写：{{loanAmt}}</td>
                    <td>大写：{{loanAmtChinese}}</td>
                </tr>
                <tr>
                    <td>还款方式</td>
                    <td colspan="2">到期一次性还本付息</td>
                </tr>
                <tr>
                    <td>到期还本付息数额</td>
                    <td colspan="2">{{totalPI}}</td>
                </tr>
                <tr>
                    <td>还款起止日期</td>
                    <td colspan="2"> 年 月 日至 年 月 日</td>
                </tr>
                <tr>
                    <td rowspan="2">借款人电子账户</td>
                    <td colspan="2">开户行：江西银行股份有限公司总行营业部</td>
                </tr>
                <tr>
                    <td colspan="2">电子账号：{{accountId}}</td>
                </tr>
            </table>
            <p>
                <span class="red">*</span> “到期还本付息数额”、“甲方收款日”仅供参考，具体金额及日期以实际收款金额及日期为准。</p>
            <p>1.2借款发放：当借款本金在募集期已全部募集完成时，出借人即不可撤销地授权第三方支付机构/存管银行将金额等同于“借款基本信息” 中列明的借款本金金额从出借人账户划转至以上1.1条借款人电子账户中，以完成款项的发放。</p>
            <p>1.3 借款发放后，借款人即不可撤销的授权居间服务人可将借款人的借款本金数额从借款人电子账户划扣至以下借款人绑定的银行卡内，具体到账时间以银行实际到账时间为准，借款人确认知晓该事项且对此无异议。</p>
            <p>借款人绑定银行卡号：{{cardNo}}</p>
            <p>1.4本协议项下借款本息将于还款日后两个自然日内划转至出借人账户内，出借人确认知晓该事项且对此无异议。</p>
            <p>1.5就本协议项下还款日而言，如当月无该日期，则以当月的最后一日为该日。如该日为非工作日的，则提前至该日前的最近一个工作日。</p>

            <p class="h3">二、借款发放、还款及逾期还款责任</p>
            <p>2.1自第三方支付机构/存管银行将借款金额自出借人账户划转至借款人电子账户时即视为出借人履行了出借义务。</p>
            <p>2.2借款人必须按照本协议的约定，按时、足额偿还借款本金和利息。借款人应确保在还款日当日 10:00 前将应还款金额划转至借款人电子账户，并不可撤销授权第三方支付机构/存管银行将应还款金额划转至出借人账户，以完成还款。</p>
            <p>出借人知晓并同意，最终将本协议项下的借款本息或受偿款项划转至出借人账户的到账时间以第三方支付机构/存管银行与出借人协议确定为准。</p>
            <p>2.3还款日当日24：00前，借款人应确保借款人电子账户中有足额应还款项，否则应视为借款人逾期。在逾期情形下，借款人除应按本协议第一条的约定支付利息外，还应支付逾期罚息。</p>
            <p>逾期罚息的计算方式为：逾期罚息=待还本金数额*逾期天数*{{defaultFeeRate}}%。</p>
            <p>2.4 借款人同意，如借款人逾期的，出借人及借款人同意并支持居间服务人采取以下措施之一项或几项：</p>
            <p>（1）将借款人的有关身份资料及其他个人信息通过居间服务人网站对外公开；</p>
            <p>（2）将借款人的有关身份资料及其他个人信息正式备案在“不良信用记录”，列入全国个人信用评级体系的黑名单；</p>
            <p>（3）对借款人采取法律措施，由此所产生的所有法律后果将由借款人来承担；</p>
            <p>2.5 提前还款：借款人提前还款的，应一次性偿还全部应付款项，且借款人需就提前还款事宜与居间服务人协商。借款人不得提前偿还部分应付款项。借款人提前还款的，应向出借人支付提前还款违约金。</p>
            <p>提前还款违约金的计算方式为： 提前还款违约金=未还本金*{{prepayFeeRate}}% 。</p>
            <p>2.6除上述约定外，借款人还需承担因未按约还款所产生的一切费用，包括但不限于诉讼费、财产保全费、执行费、仲裁费、律师代理费、差旅费、评估费、拍卖费、催收费用等。</p>
            <p class="h3">三、各方权利义务 </p>
            <p>3.1 出借人的权利义务</p>
            <p>3.1.1出借人承诺其为订立本协议提供的信息及时、合法、真实、有效，用于出借的资金来源合法。</p>
            <p>3.1.2出借人同意以网络页面点击确认的方式签订本协议，并不得以此为由拒绝履行本协议项下的义务。自点击确认完成时即视为出借人同意不可撤销及变更地授权居间服务人自主生成出借信息完成最终借款项目的撮合，且在未出现法定事由时，出借人不得否认本协议项下债权债务关系或以任何方式撤回、撤销本协议。</p>
            <p>3.1.3出借人知晓并同意，借款金额自出借人点击确认投资之日起至起息日（不含）的这段期间不产生任何收益（包括但不限于利息）。出借人有权从借款人处获得借款期间内基于借款金额的约定利息收益。</p>
            <p>3.1.4出借人同意并授权第三方支付机构/存管银行根据本协议约定从其账户中划转借款金额至借款人电子账户以履行出借义务。出借人应确保在划转之时其账户中有足够的资金以完成划款。</p>
            <p>3.1.5于约定的还款日，借款人根据本协议约定将相应的借款本金及利息划转至借款人电子账户，同意并授权第三方支付机构/存管银行从借款人电子账户划扣至出借人账户，划扣成功即视为借款人已履行还款义务。</p>
            <p>3.1.6出借人知晓并同意，居间服务人不承担本协议项下出借人的任何资金损失风险。</p>
            <p>3.1.7出借人在此确认，出借人在做出借款决定及签订本协议时，对不能知晓借款人的真实姓名、身份证号码和住址等情况应属明知，并自行承担交易风险。</p>

            <p>3.2 借款人的权利义务</p>
            <p>3.2.1借款人承诺为订立本协议而提供的信息及时、合法、真实、有效。</p>
            <p>3.2.2借款人应保证借款用途合法合规，且严格按照本协议项下借款用途使用借款。</p>
            <p>3.2.3借款人同意以网络页面点击确认的方式签订本协议，并不以此为由拒绝履行本协议项下的义务。自借款人签订本协议时即视为借款人同意不可撤销及变更地授权居间服务人自主生成借款信息完成最终借款项目的撮合，且在未出现法定事由时，借款人不得否认本协议项下债权债务关系或以任何方式撤回、 撤销本协议。</p>
            <p>3.2.4 借款人同意并授权出借人委托第三方支付机构/存管银行根据本协议约定将借款金额划转至借款人电子账户即视为出借人履行完毕放款义务。</p>
            <p>3.2.5借款人应按照本协议的约定按时支付利息及/或偿还借款本金。</p>
            <p>3.2.6当借款人的资信状况及还款能力出现重大不利影响时，借款人应以书面、传真、 电子邮件等方式及时通知出借人及居间服务人。</p>

            <p>3.3 居间服务人的权利义务</p>
            <p>3.3.1出借人和借款人同意居间服务人有权代出借人在必要时对借款人进行其所借款的违约提醒及催收工作，包括但不限于电话通知、发律师函、对借款人提起诉讼等。出借人在此确认明确委托居间服务人为其进行以上工作，并授权居间服务人可以将此工作委托给其他方进行。借款人对前述委托的提醒、催收事项已明确知晓并应积极配合。 </p>
            <p>3.3.2居间服务人有权向借款人收取双方约定的居间服务费，并在有必要时对借款人进行违约提醒及催收工作，包括但不限于电话通知、发律师函、对借款人提起诉讼等。居间服务人有权将此违约提醒及催收工作委托给本协议外的其他方进行。 </p>
            <p>3.3.3居间服务人接受出借人和借款人双方的委托行为所产生的法律后果由出借人和借款人承担。</p>
            <p>3.3.4居间服务人应对出借人和借款人的信息及本协议内容保密；如任何一方违约，或因相关权力部门要求（包括但不限于法院、仲裁机 构、金融监管机构等），居间服务人有权披露。 </p>

            <p class="h3">四、债权转让 </p>
            <p>4.1出借人和借款人同意并确认，出借人可将本协议项下的全部借款债权（“借款债权”）转让予第三人。</p>
            <p>4.2 出借人转让其借款债权的，应当在债权转让之日授权居间服务人（在必要时）以通过包括但不限于电子邮件、站内信的方式将债权转让相关信息通知给借款人。出借人、借款人均确认该通知构成合法有效的债权转让通知。如出借人未通知的，由此产生的一切后果由出借人自行承担。 </p>
            <p>4.3出借人根据本协议转让借款债权的，借款债权须全部转让，债权受让人因接受借款债权成为出借人。除此项内容变更外，本协议项下其他条款不受影响，且变更内容对借款人和担保方仍有约束力。 </p>
            <p>4.4出借人和借款人同意并确认：借款债权转让时的出借人与债权受让人通过在线点击确认的方式，签订《债权转让交易协议》。 </p>

            <p class="h3">五、服务费的收取</p>
            <p>5.1服务费是指居间服务人为借款人与出借人提供交易信息、信用咨询、信用评估、信用审核、还款提醒、账户管理、债权转让等系列相关服务而由借款人支付的报酬。</p>
            <p>5.2服务费具体收费标准由借款人与居间服务人另行协商确定。</p>
            <p>5.3服务费用的支付方式为：借款人收到借款本金后即不可撤销的授权第三方支付机构/存管银行直接从借款人电子账户划扣。</p>
            <p>5.4 服务费一经收取不予返还。</p>

            <p class="h3">六、 违约责任</p>
            <p>6.1协议各方均应严格履行合同义务，非经各方协商一致或依照本协议约定，任何一方不得解除本协议。 </p>
            <p>6.2任何一方违约，违约方应承担因违约使得其他各方产生的费用和损失，包括但不限于调查、诉讼费、律师费等，应由违约方承担。如违约方为借款人的，出借人有权立即解除本协议，并要求借款人立即偿还未偿还的本金、利息、罚息、违约金。</p>
            <p>6.3借款人同意，一旦借款人逾期还款的，居间服务人有权将借款人违约失信的相关信息及借款人的其他信息向媒体、用人单位、公安机关、检查机关、法律机关披露，居间服务人不承担任何责任。 </p>

            <p class="h3">七、协议的签订、成立及生效 </p>
            <p>7.1本协议采用电子文本形式制成，以网络点击的方式签订，出借人、借款人均委托居间服务人保管本协议；</p>
            <p>7.2 本协议自文本最终生成之日生效。</p>
            <p>7.3 居间服务人根据最终撮合结果生成协议双方信息、本协议第一条、本协议附件信息及协议签订日期信息等要素。 </p>

            <p class="h3">八、通知和送达</p>
            <p>出借人和借款人一致同意，本协议履行过程中双方之间作出的一切意思通知及往来文件，均可通过网站公告、手机短信、传真、电子邮件、挂号信、特快专递送达双方，一切意思通知及往来文件均须以书面形式送达，其中以公告、手机短信、传真、电子邮件等形式发出的，发出日即视为送达日；以挂号信、特快专递发出的，挂号信、特快专递发出后第3日为送达日。双方通讯地址及联系人信息以本协议页首载明为准。</p>

            <p class="h3">九、其他事项</p>
            <p>9.1 借款人须确保到期后足额偿还包括本协议借款本息及其他应付款项，否则视为还款未完成，由此引起的法律后果及违约责任由借款人承担。</p>
            <p>9.2 出借人及借款人必须通过本协议约定的方式进行放款及还款,否则由此引起的法律后果及违约责任由出借人或借款人自行承担。 </p>
            <p>9.3协议各方应对其他方提供的信息及本协议内容保密，未经其他方同意，任何一方不得向协议主体之外的任何人披露，但法律、行政法规另有强制性规定，或监管、审计等有权机关另有强制性要求的除外。 </p>
            <p>9.4 如本协议中的任何条款无论因何种原因完全或部分无效或不具有执行力，则应认为该条款可与本协议相分割，并可被尽可能接近双方意图的、能够保留本协议要求的经济目的的、有效的新条款所取代，而且在此情况下，本协议的其他条款仍然完全有效并具有约束力。 </p>
            <p>9.5 协议双方应按法律法规及相关规定各自承担与本协议相关的税费。</p>

            <p class="h3">十、法律的适用和争议的解决 </p>
            <p>本协议受中华人民共和国法律管辖并按中华人民共和国法律解释。协议履行中发生争议，可由双方协商解决，协商不成可向汉信互联网金融服务（武汉）股份有限公司所在地人民法院起诉。 </p>

            <p>附件：出借人列表</p>
            <table class="table f12">
                <tr>
                    <td>序号</td>
                    <td>姓名/名称</td>
                    <td>用户名</td>
                    <td>证件号码</td>
                    <td>交易金额（元）</td>
                </tr>
                <tr>
                    <td></td>
                    <td></td>
                    <td></td>
                    <td></td>
                    <td></td>
                </tr>
                <tr>
                    <td></td>
                    <td></td>
                    <td></td>
                    <td></td>
                    <td></td>
                </tr>
            </table>

        </div>

    </div>
</template>

<script>
import Back from '../toolcomponents/back';
export default {
    name: 'agreement',
    components: {
        Back
    },
    data() {
        return {
            msg: '',
            trueName: '',//姓名
            idNo: '',//身份证号
            mobile: '',//手机号
            loanAmt: '',//借款金额
            loanAmtChinese: '',//借款金额大写
            loanTerm: '',//借款期限
            interest: '',//总利息
            defaultFeeRate: '',//逾期违约费费率
            overdueFee: '',//逾期管理费
            accountId: '',//存管电子账户,
            cardNo: '',//cardNo
            prepayFeeRate: '',//逾期违约费费率
            agreementNo: '',//协议编号
            totalPI: ''
        }
    },
    methods: {
        queryData() {
            const _this = this;
            const beseUrl = _this.$store.state.config.hjd_url;
            const params = {
                applyAmt: _this.$route.query.applyAmt,
                applyTerm: _this.$route.query.applyTerm,
                productId: _this.$route.query.productId
            };
            if (_this.$store.state.userInfo != undefined) {
                const { userId, tokenId, appKey } = _this.$store.state.userInfo;
                _this.$http({
                    url: beseUrl + 'api/anon/h5/jsonpDispather.jsonp',
                    method: 'JSONP',
                    jsonp: '_callback',
                    params: encodeParams(params, userId, tokenId, appKey, beseUrl + "api/cust/getAgreementFactor")
                }).then(function(res) {
                    //alert(JSON.stringify(res.data));
                    if (res.data.code === 'SUCCESS') {
                        _this.trueName = res.data.data.trueName;
                        _this.idNo = res.data.data.idNo;
                        _this.mobile = res.data.data.mobile;
                        _this.loanAmt = res.data.data.loanAmt;
                        _this.loanAmtChinese = res.data.data.loanAmtChinese;
                        _this.loanTerm = res.data.data.loanTerm;
                        _this.interest = res.data.data.interest;
                        _this.defaultFeeRate = parseFloat(res.data.data.defaultFeeRate) * 100;
                        _this.overdueFee = res.data.data.overdueFee;
                        _this.accountId = res.data.data.accountId;
                        _this.cardNo = res.data.data.cardNo;
                        _this.prepayFeeRate = parseFloat(res.data.data.prepayFeeRate) * 100;
                        _this.agreementNo = res.data.data.agreementNo;
                        _this.totalPI = res.data.data.totalPI;
                    }
                }, function(res) {
                    _this.$toast(res.data.msg);
                });
            }

        }
    },
    created() {
        this.queryData();
    }
}
</script>
<style lang="less" scoped>
@import 'main.less';
</style>

