<template>
    <div class="agreement">
        <Back>信息获取授权书</Back>
        <div class="cantainer agreement-bd">
            <p class="b">尊敬的客户：为了维护您的权益，请仔细阅读本授权书各条款，一经勾选“同意”或点击“确认”按钮，即意味着您对本授权书内容及相应的法律后果已全部知晓并充分理解。</p>
            <p>本人不可撤销地授权汉信互联网金融服务（武汉）股份有限公司（下称“被授权方”）可就涉及本人的个人信息进行本授权书所述如下任一及全部“授权操作”。</p>
            <p>前述个人信息包括但不限于：
                <span class="b">与本人有关的基本信息、信用信息、财产信息、社会保险信息、公积金账户信息、学历信息、通信信息、电商信息、商业保险、不动产信息、税务信息、不良信息等。</span>
            </p>
            <p>授权操作包括：</p>
            <p>1、采集、保存本人与被授权方业务往来中提供或产生的个人信息，并向中国人民银行金融信息基础数据库及/或其他经过批准的征信机构（包括但不限于前海征信等）及/ 或与被授权方具有合作关系的第三方（为方便表述，上述机构以下统称“征信机构”，与被授权方具有合作关系的第三方，以下可单独成为“合作方”）提供本人个人信息和包括信贷信息在内的信用信息（含不良信用信息）。</p>
            <p>2、通过征信机构向其他拥有合法资质的第三方（包括但不限于其他拥有合法资质的征信机构、运营商及其代理商） 查询采集、核实、保存本人个人信息。</p>
            <p>3、同意被授权方将前述采集、查询、核实、保存的本人个人信息进行存储、整理、加工，用于评价本人信用情况或核实本人信息的真实性。</p>
            <p>4、被授权方可将本人的以下信息提供给被授权方合作的第三方，以便第三方向其提供专业的身份证质量检测、活体检测、身份证OCR、人脸比对、信用风险评估、大数据分析等技术服务。 </p>
            <p>（1）姓名、身份证号码、身份证件有效期限；</p>
            <p>（2）身份证正面、反面影印件；</p>
            <p>（3）被授权方终端采集的活体检测图片；</p>
            <p>（4）联系方式、通讯记录、短信、手机应用情况、运营商信息</p>
            <p>（5）工作单位信息、社保和公积金账户信息</p>
            <p>（6）财产信息</p>
            <p class="h3">本人承诺，被授权方根据本授权书中所采取的全部行动和措施的法律后果由本人承担。</p>
    
        </div>
    
    </div>
</template>

<script>
import Back from '../toolcomponents/back';
export default {
    name: 'agreement',
    components: {
        Back
    }
}
</script>


<style lang="less" scoped>
@import 'main.less';
</style>

